ankitjhall/Project_Pixybot/PWM_Code/lpc-54114----motor_control_with_button/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO010_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO010_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO029_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 2. */
#define PIO029_FUNC_ALT2 0x02u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO029_MODE_INACTIVE 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO08_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO08_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO09_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO09_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO112_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO112_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO113_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO113_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO114_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 3. */
#define PIO114_FUNC_ALT3 0x03u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO114_MODE_INACTIVE 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO115_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 2. */
#define PIO115_FUNC_ALT2 0x02u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO115_MODE_INACTIVE 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO116_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO116_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO11_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 3. */
#define PIO11_FUNC_ALT3 0x03u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO11_MODE_INACTIVE 0x00u

/*! @name SCT0_OUT7 (number 57), J2[1]/P1_14-SCTO7
  @{ */
/* @} */

/*! @name SCT0_OUT4 (number 15), J1[15]/P1_1-FC5_SSEL2
  @{ */
/* @} */

/*! @name SCT0_OUT5 (number 62), J1[17]/P1_15-SCTO5-FC7_CTS
  @{ */
/* @} */

/*! @name SCT0_OUT2 (number 11), J2[5]/D2[1]/P0_29-CT32B0_MAT3-RED
  @{ */
/* @} */

/*! @name PIO0_8 (number 43), J2[15]/P0_8-FC2_RXD_SDA_MOSI
  @{ */
#define BOARD_left_motor_speedup_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_left_motor_speedup_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_left_motor_speedup_PIN 8U    /*!<@brief 0U pin index: 8 */
                                           /* @} */

/*! @name PIO0_9 (number 44), J2[13]/P0_9-FC2_TXD_SCL_MISO
  @{ */
#define BOARD_left_motor_speeddn_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_left_motor_speeddn_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_left_motor_speeddn_PIN 9U    /*!<@brief 0U pin index: 9 */
                                           /* @} */

/*! @name PIO0_10 (number 45), J2[11]/P0_10-FC2_SCK-CT32B3_MAT0
  @{ */
#define BOARD_left_motor_dir_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_left_motor_dir_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_left_motor_dir_PIN 10U   /*!<@brief 0U pin index: 10 */
                                       /* @} */

/*! @name PIO1_12 (number 51), J2[9]/P1_12-CT32B1_MAT0-ACCl_INT1
  @{ */
#define BOARD_right_motor_dir_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_right_motor_dir_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_right_motor_dir_PIN 12U   /*!<@brief 1U pin index: 12 */
                                        /* @} */

/*! @name PIO1_13 (number 54), J2[7]/P1_13-CT32B1_MAT1
  @{ */
#define BOARD_right_motor_speedup_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_right_motor_speedup_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_right_motor_speedup_PIN 13U   /*!<@brief 1U pin index: 13 */
                                            /* @} */

/*! @name PIO1_16 (number 7), J1[19]/P1_16-CT32B0_MAT0-GYRO_INT1
  @{ */
#define BOARD_right_motor_speeddn_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_right_motor_speeddn_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_right_motor_speeddn_PIN 16U   /*!<@brief 1U pin index: 16 */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_cm4(void); /* Function assigned for the Cortex-M4F */

